{
    "sectionInfo": {
      "title": "Experiencia",
      "preTitle": "Carrera",
      "subTitle": "Actualmente lidero el area de Tecnología en el Liceo Taller San Miguel, aportando con soluciones tecnológicas y digitales para la gestión de la institución."
    },
    "currentPosition": {
      "company": "Liceo Taller San Miguel",
      "position": "Tiempo completo",
      "startDate": "2021-01-01",
      "endDate": null,
      "location": "Pereira, Risaralda, Colombia",
      "description": "El Liceo Taller San Miguel es una institución educativa que ofrece una educación integral a niños y jóvenes en la ciudad de Pereira. Como líder de tecnología, soy responsable de la planificación, implementación y mantenimiento de la infraestructura tecnológica de la institución. Esto incluye la gestión de la red, la seguridad de la información, la administración de sistemas y la implementación de soluciones digitales para la gestión de la institución.",
      "logo": "/img/company-logoi.png"
    },
    "positions": [
      {
        "title": "Lider del Area de Tecnologia",
        "startDate": "2022-06-01",
        "endDate": null,
        "description": "Soy responsable de la ideación, planificación y desarrollo de nuevos bienes de consumo y software de microservicios para clientes y empleados. Durante estos proyectos, trabajo con las partes interesadas clave dentro de nuestra empresa y cadena de suministro para garantizar y cumplir los objetivos de calidad en múltiples dominios.",
        "achievements": null,
        "badges": null
      },
      {
        "title": "Desarrollador Full Stack y Diseñador de Experiencia de Usuario",
        "startDate": "2020-02-01",
        "endDate": "2021-11-30",
        "description": "Como desarrollador full stack líder, soy responsable del desarrollo de software, CI/CD y control de calidad. Esto incluye el front-end, las API y el back-end. Además, se me asignó la tarea de identificar y analizar los puntos débiles en el recorrido del cliente y los flujos de trabajo de los empleados. Cada proyecto tuvo que ser estimado y priorizado en función de su carga de trabajo y su impacto inmediato en la eficiencia o los ingresos. Algunos de estos proyectos han tenido tanto éxito internamente que hemos planeado su refactorización para su comercialización.",
        "achievements": [
          {
            "title": "Pruebas automatizadas de atributos y configuraciones de productos",
            "result": "Eliminación de errores críticos en la entrada de datos"
          },
          {
            "title": "Informes y automatización de gestión de inventario",
            "result": "Reducción del trabajo de compra en un ~80%"
          },
          {
            "title": "Plugin de gestión de ventas con integración de carrito de compras AJAX",
            "result": "Aumento del valor promedio de pedido en un 8.3%"
          },
          {
            "title": "Software de verificación de identificación personalizado e integración con WooCommerce",
            "result": "Reducción del fraude con tarjetas de crédito en un 98%"
          }
        ],
        "badges": [
        { "key": "html5", "name": "HTML", "type": "devicon" },
        { "key": "css3", "name": "CSS", "type": "devicon" },
        { "key": "javascript", "name": "JavaScript", "type": "devicon" },
        { "key": "react", "name": "React", "type": "devicon" },
        { "key": "figma", "name": "Figma", "type": "devicon" },
        { "key": "adobexd", "name": "Adobe XD", "type": "devicon" },
        { "key": "postgresql", "name": "PostgreSQL", "type": "devicon" }
      ]
      },
      {
        "title": "Desarrollador Front-End y Diseñador de Interfaz de Usuario",
        "startDate": "2019-04-01",
        "endDate": "2020-02-29",
        "description": "Fui contratado para cubrir varios roles creativos en un entorno de inicio pequeño. Trabajé con el equipo de marketing para crear la marca y los logotipos, diseñé y desarrollé un nuevo front-end para el sitio web y mejoré la experiencia de los usuarios y los KPI de la tienda a través de optimizaciones de diseño y merchandising.",
        "achievements": [
          {
            "title": "Carrito de compras interactivo de funcionalidad completa para reemplazar la página del carrito",
            "result": "Aumento de las conversiones en un 0.7%"
          },
          {
            "title": "Menús animados de varios estados complejos representados en una interfaz elegante",
            "result": "Impulso de confianza en la marca con un menú de última generación"
          },
          {
            "title": "Diseño y desarrollo del sitio y estrategia de merchandising optimizada para el mercado",
            "result": "Tasa de conversión general del 7.1%"
          }
        ],
"badges": [
        { "key": "react", "name": "React", "type": "devicon" },
        { "key": "nodejs", "name": "Node.js", "type": "devicon" },
        { "key": "express", "name": "Express", "type": "devicon" },
        { "key": "mongodb", "name": "MongoDB", "type": "devicon" },
        { "key": "git", "name": "Git", "type": "devicon" },
        { "key": "jenkins", "name": "CI/CD", "type": "devicon" }
      ]      }
    ],
    "previousPositions": [
      {
        "company": "EcoTecnologia S.A.S",
        "position": "Soporte Tecnico",
        "startDate": "2019-01-01",
        "endDate": "2020-12-31",
        "location": "Pereira, Risaralda, Colombia",
        "description": "Era el encargado de brindar soporte técnico a los clientes de la empresa, realizando mantenimiento preventivo y correctivo a los equipos de cómputo y redes.",
        "logo": "/img/logos/ecotecnologia.png"
      },
      {
        "company": "Liceo Taller San Miguel",
        "position": "Practicante Tecnologia",
        "startDate": "2018-01-01",
        "endDate": "2018-12-31",
        "location": "Pereira, Risaralda, Colombia",
        "description": "Realice mis practicas como tecnologo en sistemas, realizando mantenimiento y soporte a la infraestructura tecnologica de la institucion.",
        "logo": "/img/company-logoi.png"
      },
      {
        "company": "Soportec",
        "position": "Medio Tiempo",
        "startDate": "2012-12-01",
        "endDate": "2018-11-30",
        "location": "Pereira, Risaralda, Colombia",
        "description": "Como Apasionado por la tecnologia 🧙‍♂️. Algo que inicio como hobby termino siendo mi primer trabajo arreglaba computadoras, tablets y teléfonos celulares."
      }
    ]
  }